<?php

return [
    'plugin_upload' => [
        'menu' => 'Μεταφόρτωση από αρχείο ZIP',
        'title' => 'Μεταφόρτωση πρόσθετου από αρχείο ZIP',
        'not_enabled' => 'Λόγω ζητήματος ασφαλείας, πρέπει να προσθέσετε <code>FOB_PLUGIN_MANAGER_ENABLED=true</code> στο αρχείο <code>.env</code> σας μετά την ενεργοποίηση αυτού του πρόσθετου για να αρχίσετε να το χρησιμοποιείτε.',
        'description' => "Μπορείτε να μεταφορτώσετε ένα πρόσθετο σε μορφή αρχείου <code>.zip</code>, το οποίο έχετε κατεβάσει από :link ή άλλες πηγές. Παρακαλούμε να είστε προσεκτικοί κατά τη μεταφόρτωση πρόσθετων, καθώς μπορεί να περιέχουν κακόβουλο κώδικα που θα μπορούσε να βλάψει τον ιστότοπό σας.",
        'upload_and_install' => 'Μεταφόρτωση & Εγκατάσταση',
        'input_file_description' => 'Βεβαιωθείτε ότι το αρχείο είναι έγκυρο σε μορφή <code>.zip</code>.',
        'installed_message' => 'Μεταφορτώθηκε το :file και εγκαταστάθηκε το πρόσθετο :name με επιτυχία.',
        'plugin_information' => [
            'title' => 'Πληροφορίες πρόσθετου',
            'id' => 'ID',
            'name' => 'Όνομα',
            'description' => 'Περιγραφή',
            'author' => 'Συγγραφέας',
            'version' => 'Έκδοση',
            'minimum_core_version' => 'Ελάχιστη έκδοση πυρήνα',
        ],
        'plugin_id_conflict' => 'Σύγκρουση ονόματος πρόσθετου με διαφορετικό ID',
        'plugin_already_installed' => 'Αυτό το πρόσθετο είναι ήδη εγκατεστημένο.',
        'plugin_available_update' => 'Το πρόσθετο εγκαταστάθηκε με επιτυχία. Επιπλέον, υπάρχει διαθέσιμη ενημέρωση για αυτό το πρόσθετο.',
        'current' => 'Τρέχον',
        'uploaded' => 'Μεταφορτωμένο',
        'activate_plugin' => 'Ενεργοποίηση πρόσθετου',
        'update_plugin' => 'Ενημέρωση πρόσθετου',
        'back' => 'Πίσω',
        'validation' => [
            'could_not_find_plugin_file' => 'Δεν ήταν δυνατή η εύρεση αρχείου πρόσθετου στο αρχείο zip σας.',
            'invalid_plugin_file' => 'Το αρχείο plugin.json στο αρχείο zip του πρόσθετού σας δεν είναι έγκυρο.',
        ],
    ],
];
